Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །འབྲུ་བདུན་མཛེས་པ་ཆེན་པོ་དང་། ཤིང་སྣུ་ཧ་མཆོག་ཏུ་མཛེས་པ། འབྲས་ཨཱ་མ་ཁུ་བསྐོལ་བ་མཛེས་པ་དང་།
en: The seven types of great and divine grains and the elegant snuhā plant are the most auspicious.

source: ཞོ་དང་འོ་མ་སོ་སོར་མཉམ་པ་དང་།
en: Raw or cooked, they are divine.

source: མེ་ཏོག་དང་། འབྲས་བུ་དང་བཅས་པ་རྣམ་པ་བདུན་པོ་སའི་དཀྱིལ་འཁོར་གྱི་ལྷ་ལ་གཏོར་མར་སྦྱིན་པར་བྱའོ། །ས་ཀུརྦ་དང་།
en: They should be offered, together with curds and milk and articles beginning with f such as flowers and fruits, as a bali to the deities of the earth element.

source: རྩབ་མོ་དང་། འབྲས་ཐུག་པོ་ཆེ་བཙོས་པའི་ཁུ་བ་དང་ལྡན་པ་འདི་རླུང་ལྷའི་གཏོར་མར་བརྗོད་དེ། རླུང་གི་དཀྱིལ་འཁོར་ཐམས་ཅད་དགྱེས་པར་བྱེད་དོ།
en: Sour gruel and cooked rice with added condiments are said to be a suitable bali for Vāyu, and so they will please all the deities of the wind element.

source: །ཞོ་དང་འོ་མ་བསྐོལ་བ་དང་། འབྲས་ཐུག་པོ་ཆེ་དང་། ཧྭགས་དང་བཅས་ཤིང་བུ་རམ་དང་བཅས་པར་ལྡན་པ་འཁུར་བ་ཟླུམ་པོ་དང་། མར་གྱིས་གང་བའི་འཁུར་བ་འདི་ནི་ཀླུའི་རྒྱལ་པོ་རྣམས་ཀྱི་གཏོར་མར་བརྗོད་དེ་ལས་ཐམས་ཅད་སྒྲུབ་པའོ། །འཁུར་བ་ཟླུམ་པོ་དང་།
en: Curds, milk, cooked rice with sugar and molasses, buns, and butter cakes are said to make a suitable bali for the nāga kings, who can help accomplish all activities. “

source: བ་བྱུང་ལྔ་དང་། པུ་ཤེལ་ཙེ་དང་། མ་ལ་ཡའི་ཙནྡན་དང་། འབྲས་ཐུག་པོ་ཆེ་དང་། ཞབས་བསིལ་དང་། མཆོད་ཡོན་རྣམས་བདུད་ཀྱི་དཀྱིལ་འཁོར་ལ་གཏོར་མར་སྦྱིན་པར་བྱའོ།
en: A bali offered to the army of Māra should consist of buns, the five products of the cow, vetiver-infused water, Malabar sandalwood, rice grain, and argha water for the feet.

source: །གུར་གུམ་གྱི་ཆུ་དང་འབྲས་ཐུག་པོ་ཆེ་ལ་དྲི་བཟང་པོས་བསྒོས་ཏེ། ཆུ་ཀླུང་གི་རྒྱལ་པོ་ལ་གཏོར་མར་སྦྱིན་པར་བྱའོ། །ཐམས་ཅད་དུ་ལས་ཐམས་ཅད་སྒྲུབ་པར་བྱེད་དོ། །རྩྭ་དཱུར་བའི་ཆུ་དང་།
en: Perfumed saffron water and rice can be offered as bali to the king of rivers in order to ensure success in all activities anywhere.

source: འོ་མ་དང་། གཏུམ་པའི་ས་བོན་བཙོས་པ་དང་། འབྲས་ཐུག་པོ་ཆེ་ནི་ཚངས་པའི་སྲིན་པོ་ཉིད་དང་། གསང་བ་པ་རྣམས་ལ་གཏོར་མར་དབུལ་བར་བྱ་སྟེ་ཐམས་ཅད་རིག་པས་སོ། །འདི་ནི་གཏོར་མར་བརྗོད་དེ།
en: The juice of darbha grass, milk, thorn-apple seeds, and cooked rice can be offered as bali by the all-knowing vidyā holder to brahmarākṣasas and guhyakas.

source: བགེགས་རྣམས་ཀྱི་དཀྱིལ་འཁོར་སྒྲུབ་པར་བྱེད་པ་ལ་བགེགས་རྣམས་ཇི་སྲིད་འཚོའི་བར་དུ་དགའ་བར་འགྱུར་ཏེ་ཐེ་ཙོམ་མེད་དོ།
en: This bali is said to control beings of the vighna class, who will remain pleased for as long as the vidyā holder lives. There can be no doubt about this.

source: །དེའི་ཕྱིར་རིག་སྔགས་འཆང་མཁས་པས་ཐམས་ཅད་ལེགས་པར་བསྒྲུབ་པར་བྱའོ།
en: Consequently, the learned vidyā holder will easily accomplish anything. “

source: །ཞོ་དང་འོ་མ་དང་འོ་ཐུག་དང་། བུ་རམ་དང་མར་དང་། ལི་ཁ་ར་དང་ལྡན་པ་འདིས་བདག་སྐྱེས་པའི་རྒྱུ་སྐར་གྱི་ལྷ་ལ་གཏོར་མར་སྦྱིན་པར་བྱ་སྟེ།
en: To his birth nakṣatras and birth deities the vidyā holder should offer a ‘personal’ bali that consists of curds, milk, and rice pudding mixed with molasses, ghee, and sugar.

source: ཚེའི་དངོས་གྲུབ་དང་། དེ་བཞིན་དུ་རྒྱས་པ་དང་། ཞི་བ་དང་། སྡིག་པ་ཐམས་ཅད་ཟློག་པར་བྱེད་དོ།
en: This will ensure his long life, prosperity, and peace, and it will prevent evil.

source: །འདི་ནི་གཏོར་མར་བརྗོད་དེ་རིག་སྔགས་འཆང་རྣམས་ཀྱི་བདེ་བ་ཐོབ་པའོ།
en: This bali is said to bring happiness to vidyā holders.

source: །བྱ་བ་གང་ཡིན་པ་དེ་རྣམས་ལ་བདག་གི་གཏོར་མཐུན་གསུམ་དུ་བྱས་ན། རིག་སྔགས་འཆང་རྣམས་ཀྱི་རིག་སྔགས་དང་། གསང་སྔགས་བདེ་བླག་ཏུ་འགྲུབ་སྟེ་ཐེ་ཙོམ་མེད་དོ།
en: Whoever offers a personal bali at the three junctions of the day will swiftly accomplish the vidyā mantra; there is no doubt.

source: །དེའི་བགེགས་ཐམས་ཅད་དང་སྡིག་པ་དང་། སྡང་བ་རྣམས་ནམ་ཡང་བར་དུ་གཅོད་པར་མི་ནུས་ཏེ་ནམ་ཡང་ཕྱིས་སྡིག་པ་མི་འབྱུང་ངོ་།
en: They will never again be troubled by vighnas, evildoers, or wicked beings, they will never again meet with obstacles, and no evil will arise for them. “

source: །རྟག་ཏུ་གཏོར་མ་རྒྱས་པ་ཐོབ་པར་བྱེད་ཅིང་། སྟོབས་དང་བརྩོན་འགྲུས་དང་ལྡན་པ་དང་ཐམས་ཅད་ཐོགས་པ་མེད་པར་འགྱུར་རོ།
en: By consistently offering the bali, the vidyā holder will obtain prosperity, strength, and energy and will be invincible in every way.

source: །དེ་ལྟ་བུ་བྱེད་བཞིན་པའི་རིག་སྔགས་སྨྲ་བའི་མཁས་པ་དེ་བགེགས་རྣམས་ཐམས་ཅད་ཀྱིས་དེ་ནམ་དུ་ཡང་མཐོང་བར་མི་འགྱུར་རོ། །གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་།
en: If a learned vidyā holder recites the vidyā while performing the rite, he will never meet with obstacles or wicked beings such as yakṣas, rākṣasas, bhūtas, or piśācas.

source: འབྱུང་པོ་དང་ཤ་ཟས་སྡང་བར་བྱེད་པ་མེད་དོ། །ནད་མེད་ཅིང་རྒྱལ་པོའི་དཔལ་མིན་མེད་ལ་སྐེམ་བྱེད་དང་། སྐེམ་པ་མེད་ལ་བརྗེད་བྱེད་དང་། ཀླུ་དང་། གཟའ་དང་།
en: He will not suffer from disease, will not lack the marks of royalty, and will not lose weight, have epileptic fits, catch diseases caused by nāgas, be possessed by spirits, or experience fevers.

source: རིམས་མེད་ཅིང་ཐམས་ཅད་ཀྱི་ཚེ་ཅུང་ཟད་ཀྱང་མེད་དོ།
en: He will never suffer from any of this.

source: །དུག་མེད་ཅིང་སྦྱར་བའི་དུག་ཉིད་ཀྱང་མེད་ལ་བྱད་སྟེམས་ཐམས་ཅད་ཀྱང་ནམ་ཡང་མི་ཡོང་སྟེ། ཀུན་ནས་དཔག་ཚད་སྟོང་ཕྲག་ཏུ་རིང་དུ་འབྲོས་པར་བྱེད་དོ།
en: He will not be affected by poisons or venoms, and kākhordas will not assail him but instead flee as far as a hundred leagues in all directions.

source: །ཀུན་ནས་སྟོབས་ཉིད་རྒྱས་པ་དང་དེ་བཞིན་དུ་ཡང་དགའ་བ་དང་། དེ་བཞིན་དུ་ཡང་སྟོབས་དང་བརྩོན་འགྲུས་དང་གཟི་བརྗིད་འཕེལ་བར་འགྱུར་རོ།
en: He will not suffer from weakness but instead will thrive, be happy, strong, and energetic, and experience vitality and growth.

source: །ཐམས་ཅད་དུ་ཕྱག་རྒྱ་དང་གསང་སྔགས་དང་ཆོ་ག་ཞིབ་མོ་ཐམས་ཅད་ཀྱི་དངོས་གྲུབ་ཐོབ་པར་བྱེད་དོ།
en: He will obtain every accomplishment, including the mastery of all mudrās, mantras, and rites.

source: །ཚེ་རིང་དུ་འཕེལ་ཞིང་ལྷ་དང་མི་རྣམས་ཀྱི་མཆོད་པའི་འོས་སུ་འགྱུར་རོ།
en: His lifespan will greatly increase, and he will be worshiped by gods and humans alike.

source: །སྐྱེས་པའི་རྒྱུ་སྐར་གྱི་ལྷ་གང་ཡིན་པ་ཡང་དྲི་ཡོངས་སུ་འཛིན་པར་འགྱུར་ཞིང་དེ་རྣམས་ཐམས་ཅད་ཀྱི་ཇི་སྲིད་འཚོའི་བར་དུ་སྟོབས་དང་བརྩོན་འགྲུས་འཕེལ་བར་བྱེད་པར་ཐེ་ཙོམ་མེད་དོ།
en: The nakṣatras and his birth deities will envelop him with fragrance. They will all cause his strength and energy to grow for as long as he lives; there is no doubt.

source: །དེ་ལ་དགྲ་མི་འབྱུང་ཞིང་ནམ་དུ་ཡང་ཕྱིར་རྒོལ་བ་དང་དགྲ་བོ་མེད་དེ་ཕྱག་རྒྱ་འཛིན་པ་ཉིད་མེད་ཀྱང་དཀྱིལ་འཁོར་གྱི་མཆོག་ཏུ་ཞུགས་པ་ཙམ་གྱི་མོད་ལའམ།
en: He will never have enemies, opponents, or adversaries. “

source: ཡང་ན་འཇུག་པའི་དཀྱིལ་འཁོར་མཐོང་བ་ཙམ་ལ་དེ་རྣམས་ཀྱི་ལུས་དེ་བཞིན་གཤེགས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུའི་བྱིན་གྱིས་བརླབས་པའི་ལུས་སུ་འགྱུར་རོ།
en: Even if he does not display the mudrā, as soon as he enters or merely sees this incomparable, great maṇḍala, his body will be personally blessed by hundreds of thousands of millions of billions of tathāgatas, as numerous as the grains of sand in ten Gaṅgā rivers.

source: །དེ་བཞིན་གཤེགས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞིའི་དྲུང་དུ་བསོད་ནམས་ཀྱི་ཕུང་པོ་རབ་ཏུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: He will acquire a heap of merit as if in the presence of hundreds of thousands of millions of billions of tathāgatas, as numerous as the grains of sand in eighty-four Gaṅgā rivers.

source: རི་རབ་ཆེན་པོ་དང་མཉམ་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དགུ་བཅུ་རྩ་དགུ་དང་མཉམ་པའི་དྲུང་དུ་དགེ་བའི་རྩ་བ་ཆེན་པོ་དང་ཡང་དག་པར་ལྡན་པར་འགྱུར་རོ།
en: He will obtain a heap of merit equal to the great Mount Sumeru and will plant the roots of great virtue as if he were in the presence of hundreds of thousands of millions of billions of tathāgatas, as numerous as the grains of sand in ninety-nine Gaṅgā rivers. “

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་ཀྱི་དམ་ཚིག་གསང་བ་དང་། ཆོ་ག་ཞིབ་མོ་དང་། གསང་སྔགས་རྣམས་ཀྱི་དངོས་གྲུབ་ཆེན་པོ་སོ་སོར་རྙེད་དོ།
en: He will enter the secret samaya of all tathāgata families and attain the great accomplishment of mantra rites.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་རིས་ཐུན་མོང་བའི་ཚོགས་བསྡུས་པའི་སར་བགྲོད་དེ་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: Received into the bodhisattva assembly where all the tathāgata families are the same, he will attain the level of irreversibility.

source: །སུམ་ཅུ་རྩ་གཉིས་ཀྱི་ལྷའི་གནས་ན་གནས་པ་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་ཚོགས་དང་ལྷན་ཅིག་ཐམས་ཅད་དུ་སྲུང་པ་དང་བསྐྱབ་པ་དང་སྦ་བའི་ཆེད་དུ་ཡང་དག་པར་སྒྲུབ་པར་འགྱུར་རོ།
en: The thirty-three deities—Śakra, the lord of the realm of Thirty-Three, and the other thirty-two gods who dwell in palaces—will all stand by to guard, protect, and defend the vidyā holder.

source: །ལག་ན་རྡོ་རྗེ་དང་རིག་པ་འཛིན་པའི་དབང་པོ་དུ་མ་རིག་པ་འཛིན་པ་བྱེད་པའི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཞིང་རྟག་ཏུ་རྗེས་སུ་འབྲང་བ་རྣམས་སྲུང་བ་དང་བསྐྱབ་པ་དང་སྦ་བའི་ཆེད་དུ་ཡང་དག་པར་སྒྲུབ་པར་འགྱུར་རོ།
en: Vajrapāṇi, the lord of vidyādharas, surrounded by a retinue of many tens of millions of vidyādharas, will remain bound to him and stand by in order to guard, protect, and defend him.

source: །སྟོབས་ཆེན་པོ་དང་བརྩོན་འགྲུས་དང་ཕ་རོལ་གནོན་པ་དང་མདངས་ཀྱི་རྣམ་པ་སོ་སོར་རྙེད་པར་འགྱུར་རོ།
en: The vidyā holder will obtain great strength, energy, valor, and vitality. “

source: །དཀྱིལ་འཁོར་མཐོང་བ་ཙམ་གྱི་མོད་ལ་བསྐལ་པ་བྱེ་བར་བརྒྱུད་ནས་བསགས་པའི་སྡིག་པ་དང་སྒྲིབ་པ་དང་། མཚམས་མེད་པ་ལྔའི་འགྲོ་བ་རྣམས་དང་མནར་མེད་པ་ལ་གཞོལ་བ་དེ་ཐམས་ཅད་ཡོངས་སུ་ཟད་ཅིང་ཡོངས་སུ་གཏུགས་པར་འགྱུར་རོ།
en: By merely beholding the maṇḍala, all the vidyā holder’s evil and obscurations—accumulated over millions upon millions of eons and including the five acts of immediate retribution that lead to rebirth in the Avīci hell—will be exhausted and terminated.

source: །ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་དོ།
en: They will be pacified and cease.

source: །དོན་ཡོད་པའི་བྱ་བའི་དངོས་གྲུབ་སོ་སོར་རྙེད་དོ།
en: The vidyā holder will thus attain the ability to accomplish his tasks without fail.

source: །སྒྲིབ་པ་དང་ཉོན་མོངས་པའི་རྙོག་པའི་དྲི་མ་དང་སེར་སྣའི་དྲི་མ་ཐམས་ཅད་དང་བྲལ་བར་འགྱུར་རོ།
en: All his obscurations, afflictions, vices, impurities, envy, and hatred will be eradicated.

source: །འཇིག་རྟེན་ཐམས་ཅད་དགའ་བ་དང་བླ་མ་ཆེན་པོ་མཆོད་པར་འོས་པར་འགྱུར་རོ།
en: He will be loved by everyone and worshiped as a great master.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཐོང་བར་འདོད་པར་ཡང་འགྱུར་རོ། །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་རྟག་ཏུ་མཆོག་སྩོལ་བར་བྱེད་ཅིང་བླ་མར་འགྱུར་རོ།
en: All the tathāgatas will be willing to see him, Noble Avalokiteśvara will always grant him boons, and he will be an important and influential person.

source: །འཆི་འཕོས་ཏེ་སྐྱེ་བ་རྗེ་བ་ན་བསམས་པ་ཉིད་ཀྱི་མོད་ལ་བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་པདྨ་ལས་རྫུས་ཏེ་སྐྱེ་བར་འགྱུར་རོ།
en: When he leaves his body behind and takes another birth, he will be born, as is his destiny, from a lotus flower in the realm of Sukhāvatī.

source: །དཀྱིལ་འཁོར་གྱི་སློབ་དཔོན་ལ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དམ་ཚིག་གི་བླ་མར་ཤེས་པར་བྱ། མཆོད་པར་བྱ། འོད་དཔག་མེད་དང་།
en: He will be known and worshiped as a maṇḍala master and a preceptor who holds the samaya of all the tathāgatas.

source: སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་མཐུ་ཆེན་ཐོབ་ཀྱི་བཀོད་པ་དང་འདྲ་བར་བལྟ་བར་བྱའོ།
en: He will be perceived as a miraculous manifestation similar to Amitābha, Avalokiteśvara, and Mahā­sthāma­prāpta, and as such he will be the master of the maṇḍala. “

source: །དེས་ན་རིག་སྔགས་འཆང་དཀྱིལ་འཁོར་གྱི་སློབ་དཔོན་དེས་ཀྱང་དཀྱིལ་འཁོར་དུ་འཇུག་པ་བྱས་ནས་ཀུན་ནས་མཚམས་བཅིང་བ་བྱས་ཤིང་།
en: After entering the maṇḍala, the vidyā holder should create the protective boundary and perform the protection rite.

source: སྲུང་བའི་ཆོ་ག་བྱས་ལ་བདག་བཅིང་བ་དང་། གཙུག་ཏོར་བཅིང་བ་དང་མཚམས་བཅིང་བ་བྱས་ཏེ།
en: He should secure himself, tie his hair into a topknot, and create the protective boundary.

source: དེའི་འོག་ཏུ་ཁ་ཤར་དུ་ཕྱོགས་ཏེ་དཀྱིལ་འཁོར་ལ་མངོན་དུ་ཕྱོགས་པས་སྐྱིལ་མོ་ཀྲུང་གིས་འདུག་ལ་དོན་ཡོད་པ་པདྨའི་གཙུག་ཏོར་སྟོང་ཕྲག་བརྒྱད་བཟླས་པར་བྱའོ།
en: Sitting in a cross-legged posture while facing eastward toward the maṇḍala, he should recite the Amogha­padmoṣṇīṣa mantra one thousand and eight times.

source: །གུ་གུལ་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་པའི་བདུག་སྤོས་དབུལ་བར་བྱའོ།
en: He should then incant some bdellium one hundred and eight times and burn it as incense.

source: །དེ་ནས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དབུས་ཀྱི་སྙིང་པོའི་དཀྱིལ་འཁོར་དུ་པདྨའི་གེ་སར་གྱི་དབུས་སུ་ཚངས་པའི་ཆ་བྱད་འཆང་བ་པདྨ་དང་ཞགས་པ་ཐོགས་ཏེ།
en: Noble Avalokiteśvara will then appear in the center of the maṇḍala, on the anthers of the lotus, wearing the garb of Brahmā and holding a lotus and a noose.

source: བཞེངས་ནས་ཕྱོགས་བཅུར་རྣམ་པར་གཟིགས་པར་མཛད་དེ་རིག་སྔགས་འཆང་ལ་བཀའ་སྩལ་པ།
en: He will look in the ten directions and say, ‘Good!

source: ཁྱོད་ཀྱིས་རིག་པ་འཛིན་པ་གྲུབ་པོ་དོན་ཡོད་པའི་ཞགས་པ་པདྨ་གཙུག་ཏོར་གྱི་རིག་པའི་རྒྱལ་པོ་འདི་རྗེས་སུ་ཟུང་ཤིག །
en: You have mastered the Amoghapāśa-Padmoṣṇīṣa, the king of vidyās.

source: རིག་སྔགས་འཆང་ཇི་ལྟར་ཡིད་ལ་བྱེད་པ་བཞིན་དུ་འདོད་པའི་མཆོག་ཐམས་ཅད་སྦྱིན་པར་འགྱུར་རོ།
en: Please accept, vidyā holder, whatever desirable boons you may have in mind; I will grant them to you.

source: །འདི་ནི་རིག་སྔགས་འཆང་དེ་རྣམས་ཀྱི་མངལ་དུ་གནས་པའི་སྐྱེ་བའི་ཐ་མ་ཡིན་ཏེ་སྐྱེ་བ་རྗེས་ནས་ཐམས་ཅད་དུ་པདྨ་ལས་རྫུས་ཏེ་སྐྱེ་བར་འགྱུར་རོ།
en: This birth, O vidyā holder, is your last birth from the womb. When you take your next birth, you will be born from a lotus flower, wherever it is, and will be able to remember your successive births.

source: །ཐམས་ཅད་དུ་ཚེ་རབས་དྲན་པར་འགྱུར་ཞིང་ཐམས་ཅད་དུ་སྐྱེ་བ་དྲན་པར་འགྱུར་རོ།
en: You will be able to recall all your lives.

source: །སྐྱེ་བ་ནས་སྐྱེ་བ་ཐམས་ཅད་དུ་དོན་ཡོད་ཞགས་པའི་དཀྱིལ་འཁོར་མཐའ་དག་དང་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ་མཐའ་དག་ཁ་ཏོན་དུ་བྱེད་དོ།
en: Everywhere, birth after birth, the entire maṇḍala of Amoghapāśa and his complete sovereign ritual will remain on the tip of your tongue.

source: །དོན་ཡོད་ཞགས་པའི་གཙུག་ཏོར་དྲི་མ་མེད་པ་ཁ་ཏོན་དུ་ཀུན་ཏུ་གནས་སོ།
en: The pure Amogha­pāśoṣṇīṣa will remain on the tip of your tongue.’ “

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཞབས་དྲུང་དུ་མཆོད་ཡོན་དང་ཞབས་བསིལ་དབུལ་བར་བྱ། ཨ་ག་རུའི་བདུག་པ་དབུལ་བར་བྱ། མེ་ཏོག་ཇི་ལྟར་འབྱོར་པ་དབུལ་བར་བྱ།
en: At that point, the vidyā holder should offer bowls with argha water for the feet, burn incense of agarwood, and offer flowers and whatever else he may have to the feet of Noble Avalokiteśvara.

source: གཤེགས་སུ་གསོལ་བར་བྱ་སྟེ། དེ་ནས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་མི་སྣང་བར་འགྱུར་རོ།
en: He should then dismiss the deity, and Noble Avalokiteśvara will disappear.

source: །དེ་ལྟ་བུ་བྱས་ནས་རིག་སྔགས་འཆང་ནམ་མཁའ་ལ་འགྲོའོ། །དོན་ཡོད་པའི་གཙུག་ཏོར་པདྨ་དྲི་མ་མེད་པའི་འོད་ཟེར་གྱི་བཀོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་སོ་སོར་ཐོབ་སྟེ།
en: After performing this rite, the vidyā holder will rise into the air and attain the samādhi called the splendorous display that is as pure as the lotus of Amoghoṣṇīṣa.

source: རིག་པ་འཛིན་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བཞིས་ཡོངས་སུ་བསྐོར་བར་འགྱུར་ཞིང་པདྨའི་རིས་ཀྱི་འཁོར་ལོས་སྒྱུར་བར་འགྱུར་རོ། །ཚེ་ལོ་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུར་འགྱུར་རོ།
en: He will acquire a retinue of vidyādharas numbering sixty-four times one hundred thousand million billion, become an emperor in the lotus family, and have a lifespan of ninety-nine times one hundred thousand million billion eons. “

source: །དཀྱིལ་འཁོར་གྱི་ཆོ་ག་དང་སྒྲུབ་ཐབས་ཀྱི་ཆོ་གའོ།། །།
en: This concludes the practice procedure of the maṇḍala. “

source: དེ་ནས་དེའི་རས་རིས་བཤད་པར་བྱ་སྟེ།
en: Now I will teach about the cloth painting used with the vidyā of Amoghapāśa-Padmoṣṇīṣa.

source: དོན་ཡོད་པའི་ཞགས་པ་པདྨ་གཙུག་ཏོར་གྱི་རིག་པས་རས་ཁྲུ་བཞི་པ་བྱས་ནས་སམ་ཡང་ན་དར་ལ་བལ་ཚོན་སྣ་ཚོགས་པས་རྣམ་པར་ཕྱེ་སྟེ།
en: It should be drawn with divine, exquisitely beautiful designs on a square piece of cloth, perhaps made of silk, and be painted in various, clearly differentiated colors.

source: ལྷའི་གཟུགས་མཆོག་ཏུ་མཛེས་པ་ཕྱག་གཉིས་པ་འོད་ཟེར་གྱིས་འཁོར་བར་བྱའོ།
en: It should be symmetrical, with each side being two cubits long.

source: །རས་རིས་སྒྲུབ་པ་ནི་དཀར་པོའི་ཕྱོགས་ཀྱི་ཚེས་བཅྭ་ལྔ་ལ་ཚོན་ལྷག་མ་མིན་པ་སྣོད་གསར་བར་བཞག་པས་རི་མོ་མཁན་གཙང་མ་ལེགས་པར་ཁྲུས་བྱས་པས་འདྲིར་གཞུག་པར་བྱའོ།
en: The vidyā holder should follow the prescribed procedure for painting and start on the full moon day of the bright fortnight. He should provide uncontaminated paints in new bowls and commission a painter who is thoroughly bathed and ritually pure. “

source: །དབུས་སུ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཚངས་པའི་ཆ་བྱད་འཆང་བ་པདྨ་རྒྱས་པས་ཡོངས་སུ་བསྐོར་བ་བྱ་སྟེ། ཁོར་ཡུག་ཏུ་འོད་འདོམ་གང་བ་ཀུན་ནས་འབར་བའི་ཕྲེང་བ་ཅན་ཕྱག་བཞི་པ།
en: Noble Avalokiteśvara should be drawn in the center wearing the garb of Brahmā, surrounded by an open lotus and a halo of light, a blazing garland that extends for one fathom in all directions.

source: ཞལ་གསུམ་པ་རལ་པའི་ཅོད་པན་གྱིས་བརྒྱན་པ་ཟླ་བ་ཚེས་པས་སྤྲས་པ།
en: He has four arms and three faces, and his hair is in a topknot adorned with a diadem and a new, crescent moon.

source: འོད་དཔག་མེད་ཀྱི་ཅོད་པན་འཆང་བ་མདུང་རྩེ་གསུམ་འཆང་བ། པདྨའི་འདབ་མ་རྣམ་པར་བཀྲ་བའི་པདྨའི་ཞགས་པ་འཆང་བ།
en: His head is crowned with Amitābha, and he holds a trident and a lotus noose adorned with lotus leaves.

source: ཕྱག་གཡོན་པར་པདྨ་འཆང་བ་པདྨའི་སྟེང་དུ་པདྨ་གཙུག་ཏོར་བྱའོ།
en: In his left hand he holds a lotus with a lotus uṣṇīṣa upon it.

source: །འདབ་མ་ཕྱེད་ཁ་བྱེ་བའི་དབུས་ཀྱི་པདྨའི་འདབ་མ་ལ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་མགུལ་ཡན་ཆད་ཙམ་ཅོད་པན་འཆང་བ་དབུ་འབར་བའི་སྙིང་པོར་ཡོད་པར་བྲི་བར་བྱའོ།
en: He should be drawn seated among the petals of a half-opened lotus, wearing a diadem the width of his neck, and with his head shining with light.

source: །ཕྱག་གཅིག་ནི་དབུགས་འབྱིན་པ་འཆང་ཞིང་རིན་པོ་ཆེའི་ཆར་འབེབས་པ།
en: One of his hands displays the gesture of giving comfort as he sends down a rain of jewels.

source: འབར་བའི་སྙིང་པོ་ཅན་རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ་སྣ་ཚོགས་པའི་གོས་འཆང་བ་བྱའོ།
en: He shines with light, is adorned with every ornament, and is dressed in various garments.

source: །པདྨའི་གདན་ལ་ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་ཉེ་དགའ་བོ་མགོ་བོ་དགུ་པ།
en: He sits on a lotus seat, surrounded by a nine-headed nāga.

source: ཀླུས་ཡོངས་སུ་བསྐོར་བ་དང་བཅས་པ་ཐལ་མོ་འཆང་ཞིང་ལུས་ཕྱེད་པར་བྱའོ།
en: The nāga kings Nanda and Upananda should be drawn with folded hands and half of their bodies showing.

source: །ཉ་དང་ཆུ་སྲིན་དང་། མེ་ཏོག་སྣ་ཚོགས་དང་། ནོར་བུ་ཤེལ་དང་། ངང་པ་དང་། ངུར་པ་དང་།
en: There should be fish and crocodiles, various flowers and jewels, and a number of surrounding pavilions adorned with swans, ducks, and pheasants. “

source: ཤང་ཤང་ཏེའུས་ཡང་དག་པར་བརྒྱན་པའི་ཁ་ཁྱེར་དང་བཅས་པས་སྤྲས་པའོ། །གཞོགས་གཡས་སུ་སྒྲོལ་མ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། ཐལ་མོ་སྦྱར་བ་སྨད་དེ་འཛིན་པ། འབར་བའི་སྙིང་པོའི་ལུས་ཅན་བྱའོ།
en: Tārā should be drawn to the right of Noble Avalokiteśvara. She is adorned with all ornaments, bows down with folded hands, and has a body suffused with light.

source: །གཡོན་དུ་གོས་དཀར་མོ་གོས་དཀར་པོ་འཆང་བ་རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ་འབར་བའི་སྙིང་པོའི་ལུས་ཅན་ཐལ་མོ་སྣང་དེ་འཆང་བའོ།
en: Pāṇḍaravāsinī should be drawn to his left, bowing with folded hands, wearing white garments, adorned with all ornaments, and with a body suffused with light.

source: །གཞོགས་གཡས་སུ་ཁྲོ་གཉེར་ཅན་སྐྱིལ་ཀྲུང་ཕྱེད་པས་བཞུགས་པ་བྱའོ།
en: To the right is Bhṛkuṭī, who should be drawn sitting with one leg drawn in and the other outstretched.

source: །དེའི་འོག་ཏུ་དཀར་ཤམ་མ་གོས་དཀར་པོ་འཆང་བ་བྱའོ།
en: Śvetā is below, wearing white clothes.

source: །གཡོན་དུ་སྲིན་མོ་ཆེན་མོ་རལ་པ་གཅིག་མ་བྱ་སྟེ།
en: The great rākṣasī Ekajaṭā should be drawn to the left.

source: ཕྱག་བརྒྱད་པ་དྲག་མོ་དྲག་ཏུ་རྒོད་པའི་ཕོ་ཉ་མོ་བྱའོ།
en: She has eight arms, is wild in appearance, and laughs loudly. Dūtī should be drawn with a frown on her face.

source: །བཞིན་ཁྲོ་གཉེར་ཅན་ཐམས་ཅད་སྐྱིལ་ཀྲུང་ཕྱེད་པས་བཞུགས་པ་རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ་ཐམས་ཅད་པདྨའི་གདན་ལ་བཞུགས་པ་བྱའོ།
en: All these goddesses sit with one leg drawn in and the other outstretched and are adorned with all ornaments and sitting on lotus seats. “

source: །སྟེང་དུ་ཚངས་པ་དང་། ཁྱབ་འཇུག་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། ལྷའི་དབང་པོ་རྣམས་ནམ་མཁའ་ནས་བཅོམ་ལྡན་འདས་དང་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱེད་བཞིན་པ་བྱའོ།
en: In the sky above the blessed Avalokiteśvara are the gods Brahmā, Viṣṇu, Maheśvara, and Indra, who are worshiping the Blessed One with offerings.

source: །འོག་ཏུ་པདྨ་ལ་གཤིན་རྗེ་དང་ཆུ་ལྷ་དང་།
en: Around a lotus pond beneath the blessed Avalokiteśvara are Yama, Varuṇa, Kubera, and Kumāra sitting with one leg drawn in and the other outstretched.

source: ལུས་ངན་དང་གཞོན་ནུ་རྣམས་ཁྲུས་བྱ་སྟེ་སྐྱིལ་ཀྲུང་ཕྱེད་པས་བཞུགས་པ་བྱའོ། །རྒྱལ་པོ་ཆེན་པོ་བཞི་རྣམས་བྱ་སྟེ།
en: The Four Great Kings should be drawn with wild forms and also sitting with one leg drawn in and the other outstretched.

source: དྲག་པོའི་གཟུགས་སྐྱིལ་ཀྲུང་ཕྱེད་པས་བཞུགས་ཏེ་དེ་རྣམས་ཐམས་ཅད་ཀྱང་པདྨ་འཛིན་པའི་གཟུགས་སུ་བྱའོ།
en: They should all be depicted holding lotus flowers.

source: །རིག་སྔགས་འཆང་ནི་བཅོམ་ལྡན་འདས་དང་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཞབས་དྲུང་དུ་པདྨའི་གདན་ལ་རིག་སྔགས་འཆང་པུས་མོ་བཙུགས་པ་བྱ་སྟེ། པོག་ཕོར་དང་ལག་ན་མེ་ཏོག་གི་ཕོར་པ་དང་། བགྲང་ཕྲེང་འཛིན་པ་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་ལ་ལྟ་བར་བྱེད་བཞིན་པ་བྱའོ།
en: The vidyā holder should be drawn at the feet of the noble lord Avalokiteśvara, kneeling on one knee by the lotus pond, looking up at the face of the Blessed One, and holding an incense holder, a vase with flowers, and a rosary.

source: །དེ་ལྟ་བུའི་རས་རིས་ཀྱི་བྱ་བ་པདྨ་ཡངས་པའི་དཀྱིལ་འཁོར་མཐའ་དང་།
en: When painted on the cotton cloth, the entire maṇḍala should be enclosed within a lotus that fits on the cloth. “

source: རས་རིས་དཀྱིལ་འཁོར་མཐའ་དག་གི་ནང་དུ་གཏོགས་པར་འགྱུར་རོ། །མཐོང་བ་ཙམ་གྱི་མོད་ལ་སྡུག་བསྔལ་དང་སྡིག་པ་དང་ངན་འགྲོ་ཐམས་ཅད་རྣམ་པར་ཉམས་པར་བྱེད་དོ། །ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར་རོ། །འགྲོ་བ་ཐམས་ཅད་གཅོད་པར་འགྱུར་རོ།
en: When someone merely sees this maṇḍala, all his suffering, misfortunes, and unhappy destinies will cease; they will all be pacified so that he is freed from all saṃsāric destinies.

source: །ཉེས་པར་བྱས་པ་ཐམས་ཅད་འཇོམས་པར་ཡང་འགྱུར་རོ། །སྡིག་པ་དང་སྒྲིབ་པ་ཐམས་ཅད་དང་མཚམས་མེད་པ་ལྔ་ལས་རྣམ་པར་ཐར་བར་བྱེད་དོ།
en: All his evil actions will be annihilated, and he will be freed from all his evil and obscurations, including the five acts with immediate retribution.

source: །མཐོང་བ་ཙམ་གྱི་མོད་ལ་དོན་ཡོད་པའི་དངོས་གྲུབ་སོ་སོར་ཐོབ་བོ།
en: By merely beholding the maṇḍala, he will attain the amogha accomplishment.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཀུན་དུ་བསྐོར་བར་བྱ་བ་དང་མཆོད་པར་བྱ་བའི་འོས་སུ་འགྱུར་རོ། །དགོངས་པ་ཐམས་ཅད་ལེགས་པར་གྲུབ་པར་བྱེད་པར་འགྱུར་རོ། །བདེ་བར་བྱེད་པར་འགྱུར་རོ། །ནོར་དང་། གཟུགས་བྱེད་པ་དང་། བཀྲ་ཤིས་དང་།
en: He will be followed and worshiped by all beings, will fulfill all their wishes, and will bring them well-being, prosperity, good fortune, enjoyment, family, influence, strength, eloquence, merit, and pleasures.

source: ལོངས་སྤྱོད་དང་། རིགས་དང་། དབང་ཕྱུག་དང་། སྟོབས་དང་། སྤོབས་པ་དང་།
en: He will attain greatness, qualities, distinction, and steadfastness.

source: བསོད་ནམས་དང་། སྐལ་བ་བཟང་པོར་བྱེད་པ་དང་། བདག་ཉིད་ཆེན་པོའི་ཡོན་ཏན་གྱི་བྱེ་བྲག་འཕེལ་བ་དང་བསོད་ནམས་བསགས་པ་དང་། དགེ་བའི་རྩ་བ་མངོན་པར་འཕེལ་པ་དང་ཕུན་སུམ་ཚོགས་པར་བྱེད་དོ།
en: He will accumulate abundant merit, and his roots of virtue and good fortune will grow.

source: །མཐོང་བ་ཙམ་གྱི་མོད་ལ་ལས་སུ་བྱ་བར་འོས་པའི་བྱ་བ་ཐམས་ཅད་བྱེད་དོ།
en: By merely beholding the maṇḍala, the viewer will be able to perform all the tasks that he needs to perform.

source: །དེ་ལྟར་རས་རིས་མཐོང་བ་ཙམ་གྱི་མོད་ལ་ཡོན་ཏན་གྱི་བྱེ་བྲག་ལྷག་པར་རྟོགས་པར་འགྱུར་རོ་ཞེས་སོ།
en: In this way, by merely beholding the maṇḍala depicted in the cloth painting, he will attain distinction with all the excellent qualities that were specified. “

source: །རས་རིས་སྒྲུབ་པའི་ཆོ་ག་དང་སྒྲུབ་ཐབས་ཀྱི་ཆོ་གའོ།། །།
en: This concludes the instructions on the practice procedure of the painting. “

source: དེ་ནས་ཕྱག་རྒྱ་བཤད་པར་བྱ་སྟེ། ཕྱག་རྒྱ་རྣམས་ཀྱི་དོན་ཡོད་པའི་འཁོར་ལོས་སྒྱུར་བ་ཕྱག་རྒྱ་ཆེན་པོ་བླ་ན་མེད་པ་འཇིག་རྟེན་དབང་ཕྱུག་གི་རྒྱས་བཏབ་པ།
en: Now, among the various mudrās, I will teach the mudrā whereby the vidyā holder can become an amogha emperor with a royal wheel.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་བྱེད་པ་དོན་ཡོད་པའི་ཕྱག་རྒྱ་ཐམས་ཅད་དང་སྒྲུབ་ཐབས་ཐམས་ཅད་ཀྱི་དངོས་གྲུབ་བླ་ན་མེད་པ།
en: This great mudrā has no equal and was devised by the Lord of the World to benefit all beings.
